/*
x$kgllk - блокировки библиотечного кэша:

kgllkuse - адрес сеанса;
kgllkhdl Ц дескриптор KGL объекта (объекта в Kernel Generic Library cache);
kgllkcnt - количество блокировок объекта;
kgllkmod Ц режим захвата блокировки;
kgllkreqЦ режим запроса блокировки;
x$kglpn Ц закреплени€ в библиотечном кэше

kglpnhdl - дескриптор KGL объекта;
kglpnuse - адрес сеанса;
kglpncnt - количество закреплений объекта в сеансе (включа€ зависимые объекты);
kglpnmod Ц режим захвата закреплени€ объекта;
kglpnreq Ц режим запроса закреплени€ объекта;
x$kglob Цресурсы библиотечного кэша

kglhdadr Ц дескриптор KGL объекта;
kglnaown Ц владелец ресурса;
kglnaobj Ц им€ ресурса;
x$ksuse - текущие сеансы

addr Ц адрес сеанса;
ksusenum Ц идентификатор сеанса (SID);
ksuudlna Ц им€ пользовател€;
ksuseopc Ц номер событи€;
x$ksled Ц наименовани€ событий
*/
